---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
source: html/c48197de-da8e-4cf1-8d3c-748550ab3d14.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.#ctor Method

Creates a new instance of Structural Section Pipe.

## Syntax (C#)
```csharp
public StructuralSectionGeneralR(
	double diameter,
	double wallNominalThickness,
	double wallDesignThickness,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
```

## Parameters
- **diameter** (`System.Double`) - Pipe Diameter.
- **wallNominalThickness** (`System.Double`) - Represents wall nominal thickness of rectangle.
- **wallDesignThickness** (`System.Double`) - Represents wall design thickness of rectangle.
- **centroidHorizontal** (`System.Double`) - Distance from centroid to the left extremites along horizontal axis.
- **centroidVertical** (`System.Double`) - Distance from centroid to the upper extremites along vertical axis.
- **analysisParams** (`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams`) - Common set of parameters for structural analysis.